const knowledge = [
    [
      "Полевая кухня",
      "предназначена",
      "для приготовления пищи в условиях полевых операций и экспедиций.",
    ],
    [
      "Кулинарное оборудование",
      "включает",
      "различные переносные плиты, горелки, котлы и посуду для приготовления пищи.",
    ],
    [
      "Питание в полевых условиях",
      "требует",
      "особого внимания к сохранности и качеству продуктов.",
    ],
    [
      "Полевая кухня",
      "является",
      "неотъемлемой частью военных операций и экспедиций.",
    ],
    [
      "Благодаря развитию полевых кухонь",
      "появляется",
      "более компактное и эффективное оборудование.",
    ],
    [
      "Полевая кухня",
      "обеспечивает",
      "возможность готовить еду вдали от обычных кухонных условий.",
    ],
    [
      "Мобильность полевых кухонь",
      "делает",
      "их неотъемлемой частью военных стратегий и тактик.",
    ],
    [
      "Полевые кухни",
      "могут быть",
      "адаптированы для различных климатических условий и типов местности.",
    ],
    [
      "Важность полевых кухонь",
      "подчеркивается",
      "их способностью обеспечивать воинов питательной и вкусной пищей.",
    ],
    [
      "Инновации в области полевой кухни",
      "усовершенствуют",
      "процесс приготовления и сохранности продуктов питания.",
    ],
    [
      "Полевые кухни",
      "работают",
      "на различных видах топлива, что делает их универсальными.",
    ],
    [
      "Обучение персонала",
      "является",
      "важным аспектом использования полевых кухонь для обеспечения безопасности и эффективности.",
    ],
    [
      "Эволюция полевых кухонь",
      "отражает",
      "необходимость адаптации к изменяющимся условиям и потребностям.",
    ],
    [
      "Разнообразие блюд",
      "способствует",
      "поддержанию боевого духа и здоровья солдат.",
    ],
    [
      "История полевой кухни",
      "отражает",
      "необходимость обеспечения питания в условиях полевых операций с древних времен.",
    ],
    [
      "Первые полевые кухни",
      "являются",
      "простыми конструкциями, основанными на доступных материалах и технологиях.",
    ],
    [
      "Современные полевые кухни",
      "включают",
      "различные инновационные технологии для повышения эффективности и безопасности.",
    ],
    [
      "Роль полевой кухни",
      "подчеркивается",
      "ее способностью обеспечивать энергетически насыщенную пищу в отдаленных районах.",
    ],
    [
      "Кулинарные традиции в армиях",
      "влиюят",
      "на организацию и стандарты полевого питания.",
    ],
    [
      "Полевые кухни",
      "важны",
      "для поддержания боеспособности и морального духа военнослужащих.",
    ],
    [
      "Эксперименты с полевой кухней",
      "приводят",
      "к разработке различных моделей и конструкций для оптимизации процесса готовки.",
    ],
    [
      "Строительство полевых кухонь",
      "требует",
      "учета факторов безопасности, гигиены и энергоэффективности.",
    ],
    [
      "Полевая кухня",
      "способствует",
      "формированию социальных связей и командного духа среди военнослужащих.",
    ],
    [
      "Использование полевых кухонь",
      "распространено",
      "не только среди военных, но и среди путешественников и авантюристов.",
    ],
    [
      "Развитие полевых кухонь",
      "отражает",
      "необходимость обеспечения питания в условиях полевых операций и экспедиций.",
    ],
    [
      "Технологический прогресс",
      "способствует",
      "созданию более эффективных и компактных полевых кухонь.",
    ],
    [
      "Инновации в области полевой кухни",
      "позволяют",
      "сократить время приготовления пищи и увеличить ее качество.",
    ],
    [
      "Эволюция полевых кухонь",
      "отражает",
      "постоянное стремление к улучшению условий и процессов питания в полевых условиях.",
    ],
    [
      "Безопасность пищи",
      "является",
      "важным аспектом при разработке и использовании полевых кухонь.",
    ],
    [
      "Эффективность полевых кухонь",
      "зависит",
      "от опыта и профессионализма персонала, а также от качества оборудования.",
    ],
    [
      "Социальная значимость полевой кухни",
      "подчеркивается",
      "ее способностью объединять людей вокруг общего стола.",
    ],
    [
      "Готовность полевых кухонь к работе",
      "делает",
      "их незаменимым атрибутом военной и гражданской инфраструктуры в любых условиях.",
    ],
    [
      "История создания полевых кухонь",
      "свидетельствует",
      "о необходимости разработки специального оборудования для приготовления пищи в полевых условиях.",
    ],
    [
      "Роль полевой кухни в армиях",
      "отмечается",
      "как один из ключевых элементов поддержания боеспособности войск.",
    ],
    [
      "Техническое обслуживание полевых кухонь",
      "осуществляется",
      "с целью обеспечения их бесперебойной работы.",
    ],
    [
      "Эффективное использование полевых кухонь",
      "подразумевает",
      "оптимальное использование ресурсов и минимизацию отходов.",
    ],
    [
      "Полевая кухня",
      "предполагает",
      "не только техническое оборудование, но и квалифицированный персонал.",
    ],
    [
      "Учебные программы по обслуживанию полевых кухонь",
      "разрабатываются",
      "с целью обеспечения высокого профессионализма персонала.",
    ],
    [
      "Инновации в области упаковки продуктов",
      "способствуют",
      "их долгосрочному сохранению и транспортировке до места использования.",
    ],
    [
      "Разработка новых материалов для полевых кухонь",
      "позволяет",
      "сделать их более легкими и прочными.",
    ],
    [
      "Утилизация отходов на полевых кухнях",
      "осуществляется",
      "с целью минимизации экологического воздействия.",
    ],
    [
      "Технический персонал на полевых кухнях",
      "поддерживает",
      "работоспособность оборудования и ведет его текущий ремонт.",
    ],
    [
      "Обеспечение гигиены на полевых кухнях",
      "играет",
      "ключевую роль в предотвращении заболеваний и отравлений.",
    ],
    [
      "Полевые кухни",
      "организоваваются",
      "как стационарные или мобильные пункты питания.",
    ],
    [
      "Тренировки на полевых кухнях",
      "проводятся",
      "с целью подготовки персонала к работе в экстремальных условиях.",
    ],
    [
      "Использование энергосберегающих технологий на полевых кухнях",
      "позволяет",
      "сократить расход топлива и электроэнергии.",
    ],
    [
      "Контроль качества продуктов на полевых кухнях",
      "производится",
      "согласно установленным стандартам и требованиям.",
    ],
    [
      "Сетевое подключение полевых кухонь",
      "обеспечивает",
      "поддержку оперативной связи и передачу данных.",
    ],
    [
      "Развитие дистанционного управления на полевых кухнях",
      "позволяет",
      "оптимизировать процессы приготовления пищи и контролировать оборудование удаленно.",
    ],
    [
      "Полевые кухни",
      "способствуют",
      "поддержанию высокого уровня боеспособности военнослужащих.",
    ],
    [
      "Инструкции по безопасности на полевых кухнях",
      "разрабатываются",
      "для предотвращения несчастных случаев и ЧП.",
    ],
    [
      "Эффективное распределение обязанностей на полевых кухнях",
      "повышает",
      "производительность и качество обслуживания.",
    ],
    [
      "Полевые кухни",
      "оборудуют",
      "системами очистки воды для обеспечения безопасного питьевого водоснабжения.",
    ],
    [
      "Использование солнечных батарей на полевых кухнях",
      "позволяет",
      "снизить зависимость от традиционных источников энергии.",
    ],
    [
      "Технический персонал на полевых кухнях",
      "проходит",
      "регулярное обучение для поддержания навыков и знаний.",
    ],
    [
      "Разработка программного обеспечения для автоматизации процессов на полевых кухнях",
      "способствует",
      "улучшению эффективности и точности работы.",
    ],
    [
      "Использование надежных контейнеров для хранения продуктов на полевых кухнях",
      "предотвращает",
      "повреждение и порчу продовольствия.",
    ],
    [
      "Создание устойчивых катализаторов для систем отопления на полевых кухнях",
      "снижает",
      "вредные выбросы и улучшает экологическую совместимость.",
    ],
    [
      "Использование дистанционных сенсоров для мониторинга температуры на полевых кухнях",
      "обеспечивает",
      "поддержание оптимальных условий хранения и приготовления пищи.",
    ],
    [
      "Обучение персонала по правилам пожарной безопасности на полевых кухнях",
      "проводится",
      "с целью предотвращения пожаров и обеспечения безопасной работы.",
    ],
    [
      "Использование теплоизоляционных материалов для конструкции полевых кухонь",
      "сохраняет",
      "тепло и снижает энергопотребление в условиях холода.",
    ],
    [
      "Тщательная проверка продуктов перед приготовлением на полевых кухнях",
      "гарантирует",
      "безопасность и качество готовой пищи.",
    ],
    [
      "Разработка специальных меню для диетического и вегетарианского питания на полевых кухнях",
      "удовлетворяет",
      "разнообразные потребности военнослужащих и персонала.",
    ],
    [
      "Использование биоразлагаемой посуды и упаковки на полевых кухнях",
      "снижает",
      "негативное воздействие на окружающую среду.",
    ],
    [
      "Подготовка экстренных запасов продовольствия на полевых кухнях",
      "обеспечивает",
      "продолжительность работы в условиях, когда поставки могут быть затруднены.",
    ],
    [
      "Применение систем автоматической дозировки ингредиентов на полевых кухнях",
      "уменьшает",
      "возможность ошибок и обеспечивает стабильное качество блюд.",
    ],
    [
      "Проведение регулярных инспекций оборудования на полевых кухнях",
      "позволяет",
      "выявлять проблемы на ранней стадии и предотвращать поломки.",
    ],
    [
      "Использование систем автоматизированного управления запасами на полевых кухнях",
      "оптимизирует",
      "процесс закупки и хранения необходимых продуктов.",
    ],
    [
      "Обучение персонала методам экономии воды на полевых кухнях",
      "способствует",
      "рациональному использованию ограниченных ресурсов.",
    ],
    [
      "Обучение персонала на полевых кухнях",
      "проводится",
      "с целью подготовки к работе в условиях экстремальных температур.",
    ],
    [
      "Применение систем автоматизированной очистки воздуха на полевых кухнях",
      "позволяет",
      "снизить риск распространения инфекций и аллергических реакций.",
    ],
    [
      "Использование биометрической идентификации персонала на полевых кухнях",
      "обеспечивает",
      "контроль доступа и безопасность.",
    ],
    [
      "Эффективное управление отходами на полевых кухнях",
      "способствует",
      "сохранению окружающей среды и минимизации негативного воздействия на экосистемы.",
    ],
    [
      "Проведение регулярных инструктажей на полевых кухнях",
      "повышает",
      "осведомленность персонала о правилах безопасности и соблюдение стандартов.",
    ],
    [
      "Использование высокоэффективных систем фильтрации воды на полевых кухнях",
      "гарантирует",
      "качество питьевой воды даже в условиях неблагоприятной экологии.",
    ],
    [
      "Обеспечение разнообразия в меню на полевых кухнях",
      "повышает",
      "моральный дух и психологическое благополучие персонала.",
    ],
    [
      "Использование систем GPS на полевых кухнях",
      "обеспечивает",
      "точное определение местоположения для более эффективной логистики и безопасности.",
    ],
    [
      "Регулярные проверки санитарно-гигиенических условий на полевых кухнях",
      "предотвращают",
      "распространение инфекций и заболеваний.",
    ],
    [
      "Применение технологий искусственного интеллекта на полевых кухнях",
      "ускоряет",
      "процессы принятия решений и повышает точность работы.",
    ],
    [
      "Разработка специализированных диетических рационов на полевых кухнях",
      "учитывает",
      "индивидуальные потребности и здоровье персонала.",
    ],
    [
      "Использование адаптивных систем регулирования температуры на полевых кухнях",
      "позволяет",
      "поддерживать комфортные условия работы в различных климатических зонах.",
    ],
    [
      "Обучение персонала первой медицинской помощи на полевых кухнях",
      "способствует",
      "быстрому реагированию на чрезвычайные ситуации и спасению жизней.",
    ],
    [
      "Разработка систем рационального использования энергии на полевых кухнях",
      "снижает",
      "энергозатраты и экономит ресурсы.",
    ],
    [
      "Использование специализированных программных приложений для учета и анализа данных на полевых кухнях",
      "облегчает",
      "управление ресурсами и повышает эффективность процессов.",
    ],
    [
      "Разработка систем автоматизированной утилизации отходов на полевых кухнях",
      "позволяет",
      "минимизировать негативное воздействие на окружающую среду и сэкономить ресурсы.",
    ],
    [
      "Использование технологии блокчейн для обеспечения прозрачности и надежности данных на полевых кухнях",
      "повышает",
      "доверие и безопасность информации.",
    ],
    [
      "Разработка методов экологической упаковки на полевых кухнях",
      "снижает",
      "вредное воздействие на окружающую среду и поддерживает устойчивое производство.",
    ],
    [
      "Использование мобильных приложений для автоматизации учета и планирования на полевых кухнях",
      "оптимизирует",
      "процессы и повышает эффективность управления.",
    ],
    [
      "Разработка систем автоматического контроля качества продуктов на полевых кухнях",
      "обеспечивает",
      "соответствие стандартам безопасности и качества.",
    ],
    [
      "Использование беспилотных авиационных систем для доставки продуктов на полевые кухни",
      "обеспечивает",
      "быструю и безопасную транспортировку в труднодоступные районы.",
    ],
    [
      "Разработка систем медицинского мониторинга на полевых кухнях",
      "позволяет",
      "своевременно выявлять и предотвращать заболевания среди персонала.",
    ],
    [
      "Использование систем обратного осмоса для очистки воды на полевых кухнях",
      "гарантирует",
      "получение высококачественной питьевой воды из любых источников.",
    ],
    [
      "Разработка технологий переработки органических отходов на полевых кухнях",
      "содействует",
      "созданию замкнутого цикла использования ресурсов и уменьшению экологического следа.",
    ],
    [
      "Использование систем гидропоники для выращивания свежих овощей на полевых кухнях",
      "обеспечивает",
      "доступ к свежим продуктам в любых климатических условиях.",
    ],
    [
      "Разработка программ обучения по кулинарному искусству на полевых кухнях",
      "повышает",
      "профессионализм персонала и качество приготовления блюд.",
    ],
    [
      "Использование беспроводных сетей связи для организации интернет-доступа на полевых кухнях",
      "обеспечивает",
      "коммуникацию и обмен информацией в удаленных районах.",
    ],
    [
      "Полевая кухня",
      "выглядит",
      'так <br/><br/> <img src="../images/kitchen_detailed.jpg" />'
    ],
    [
      "Разработка систем виртуальной реальности для тренировок на полевых кухнях",
      "усиливает",
      "иммерсивный опыт обучения и подготовки персонала.",
    ],
    [
      "Использование технологий 3D-печати для создания индивидуальных кухонных инструментов на полевых кухнях",
      "обеспечивает",
      "персонализацию и оптимизацию рабочих процессов.",
    ],
    [
      "Разработка методов биоинженерии для увеличения урожайности на полевых кухнях",
      "повышает",
      "доступность свежих и питательных продуктов для персонала.",
    ],
    [
      "Использование адаптивных систем управления на полевых кухнях",
      "позволяет",
      "адаптировать процессы к изменяющимся условиям и потребностям.",
    ],
    [
      "Разработка систем дистанционного мониторинга и управления для полевых кухонь",
      "обеспечивает",
      "оптимизацию процессов и увеличение оперативности реагирования.",
    ],
    [
      "Использование систем автоматической дезинфекции на полевых кухнях",
      "повышает",
      "уровень гигиены и предотвращает распространение инфекций."
    ],
    [
      "Первая полевая кухня приготовления",
      "выглядела",
      'так <br/><br/> <img src="../images/first_kitchen.jpg" />'
    ],
    [
      "Котел",
      "выглядит",
      'так <br/><br/> <img src="../images/kotel.jpg" />'
    ],
    [
      "Электроспираль",
      "выглядит",
      'так <br/><br/> <img src="../images/elektro_spiral.jpg" />'
    ],
  ];
  

//для хранения псевдоокончаний сказуемых 
let endings =
[
    ["ет","(ет|ут|ют)"], 
    ["ут","(ет|ут|ют)"], 
    ["ют","(ет|ут|ют)"],		     //1 спряжение

    ["ит","(ит|ат|ят)"], 
    ["ат","(ит|ат|ят)"], 
    ["ят","(ит|ат|ят)"],		     //2 спряжение

    ["ется","(ет|ут|ют)ся"], 
    ["утся","(ет|ут|ют|ующие)ся"], 
    ["ются","(ет|ут|ют)ся"], //1 спряжение, возвратные

    ["ится","(ит|ат|ят)ся"], 
    ["атся","(ит|ат|ят)ся"], 
    ["ятся","(ит|ат|ят)ся"],     //2 спряжение, возвратные

    ["ящие","ящие"],
    ["ee", "ee"],
    ["ен","ен"],
    ["ую","ая"],
    ["му","ма"],
    ["ена","ена"], 
    ["ено","ено"], 
    ["ены","ены"],		    //краткие прилагательные

    ["ан","ан"], 
    ["ая","ую"],
    ["ана","ана"], 
    ["ано","ано"], 
    ["аны","аны"],		    //краткие прилагательные

    ["но", "но"], 
    ["на", "на"],

    ["жен","жен"], 
    ["жна","жна"], 
    ["жно","жно"], 
    ["жны","жны"],

    ["такое", "- это"],
]

//«черный» список подлежащих
let blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"]

//определения сказуемых в вопросе по псевдоокончаниям
function getEndingIndex(word)
{
    //проверка слова на совпадение по черному списку в массиве blacklist
    if(blacklist.indexOf(word) !== -1)
        return -1;
    
    //перебор псевдоокончаний в массиве endings
    for(let i = 0; i < endings.length; i++)
        //проверка, оканчивается ли слово word на iE-ое псевдоокончание
        if(word.substring(word.length - endings[i][0].length) == endings[i][0])     // substring(начальный индекс, конечный)
            //возврат номера найденного псевдоокончания для сказуемого 
            return i;

    //если совпадений нет, то возврат -1
    return -1;
} // пример: такое (5) - ет (2) == ет

//Функция, которая делает первую букву в тексте маленькой:
function firstSymbolToLowerCase(str)
{
    return str.substring(0, 1).toLowerCase() + str.substring(1);
}

//Функция, которая делает первую букву в тексте большой:
function firstSymbolToUpperCase(str)
{
    return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question)
{
    //преобразование текста из параметра функции question 
    //чтобы сделать первую букву в тексте вопроса прописной (масенькой)
    let text = firstSymbolToLowerCase(question);
    //знаки препинания
    let separators = "'\",.!?()[]\\/";
    //добавление пробелов перед знаками препинания
    for(let i = 0; i < separators.length; i++)
        text = text.replace(separators[i], " " + separators[i]);    // replace(что заменить, на что заменить)

    //массив слов и знаков препинания, отделенных пробелами
    let words = text.split(' ');

    //перебор слов в массиве слов из вопроса: первый символ каждого слова к lowerCase
    for(let i = 0; i < words.length; i++)
        words[i] = firstSymbolToLowerCase(words[i]);

    //флаг, найден ли ответ на вопрос
    let result = false;
    let answer = "";

    for(let i = 0; i < words.length; i++)
    {
        // поиск номера псевдоокончания сказуемого
        let ending = getEndingIndex(words[i]);

        if(ending >= 0)
        {
            //замена псевдоокончания на набор возможных окончаний, хранящихся 
            //во втором столбце массива. пример, глагол "ведет"(5) - endings[0][0].length (ет(2)). substring(0, 3) = вед + (ет|ут|ют) = вед(ет|ут|ют)

            words[i] = words[i].substring(0, words[i].length - endings[ending][0].length) + endings[ending][1]

            console.log(words)
            
            //создание регулярного выражения для поиска по сказуемому из вопроса
            let predicate = new RegExp(".*" + words[i] + ".*");     // .*: любой символ (кроме новой строки) ноль или более раз.

            //для кратких прилагательных нужно захватить следующее за найденным слово
            if(endings[ending][0] == endings[ending][1])
            {
                if(words[i] != "нужен")
                {
                    predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");    // захватываем следующее за ним слово
                    i++;
                }
            }
            console.log(predicate)  

            //создание регулярного выражения для поиска по подлежащему из вопроса. пример «Как рассчитывается площадь квадрата» после сказуемого будет сформировано 
            //регулярное выражение  для подлежащего: «.*площадь.*квадрата.*», 

            let subjectReg = words.slice(i + 1).join(".*");
            //words.slice(i + 1): Метод slice используется для создания нового массива, начиная с элемента i + 1 и до конца массива words. Он возвращает подмассив, не изменяя 
            //оригинальный массив.

            //.join(".*"): Метод join используется для объединения элементов массива в строку с указанным разделителем. В данном случае, элементы массива будут 
            //объединены с использованием строки ".*" в качестве разделителя.
            console.log(subjectReg)
            
            //только если в подлежащем больше трех символов
            if(subjectReg.length > 3)
            {
                let subject = new RegExp(".*" + subjectReg + ".*");
                console.log(subject)

                //поиск совпадений с шаблонами среди связей семантической сети
                for(let j = 0; j < knowledge.length; j++)
                {
                    if(predicate.test(knowledge[j][1].toLowerCase()) && (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())))
                    {
                        //создание простого предложения из семантической связи
                        answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2] + "<br>");
                        result = true;
                    }
                }

                //если совпадений с двумя шаблонами нет,
                if(!result)
                {
                    //поиск совпадений только с шаблоном подлежащего
                    for(let j = 0; j < knowledge.length; j++)
                    {
                        if(subject.test(knowledge[j][0].toLowerCase() || subject.test(knowledge[j][2].toLowerCase())))
                        {
                            //создание простого предложения из семантической связи
                            answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2] + "<br>");
                            result = true;
                            break;
                        }
                    }
                }
            }
        }
    }
    //если ответа нет
    if(!result)
        answer = "Ответ не найден. <br/>";
    return answer;
}
    
const questions = [
    "Для чего предназначена полевая кухня?",
    "Что включает кулинарное оборудование?",
    "Что требует питание в полевых условиях?",
    "Чем является полевая кухня?",
    "Что появляется благодаря развитию полевых кухонь?",
    "Что обеспечивает полевая кухня?",
    "Что делает мобильность полевых кухонь?",
    "Что способствует технологический прогресс?",
    "Для чего могут быть адаптированы полевые кухни?",
    "Чем подчеркивается важность полевых кухонь?",
    "Что усовершенствуют инновации в области полевой кухни?",
    "На каких видах топлива работают полевые кухни?",
    "Чем является обучение персонала?",
    "Чем отражает эволюция полевых кухонь?",
    "Что способствует поддержанию боевого духа и здоровья солдат?",
    "Чем отражает история полевой кухни?",
    "Чем являются первые полевые кухни?",
    "Что включают современные полевые кухни?",
    "Чем подчеркивается роль полевой кухни?",
    "На что влияют кулинарные традиции в армиях?",
    "Для чего важны полевые кухни?",
    "К чему приводят эксперименты с полевой кухней?",
    "Что требует строительство полевых кухонь?",
    "Чем способствует полевая кухня?",
    "Чем распространено использование полевых кухонь?",
    "Чем отражает развитие полевых кухонь?",
    "Чем способствует технологический прогресс?",
    "Что позволяют инновации в области полевой кухни?",
    "Чем отражает эволюция полевых кухонь?",
    "Чем является безопасность пищи?",
    "От чего зависит эффективность полевых кухонь?",
    "Чем подчеркивается социальная значимость полевой кухни?",
    "Чем делает готовность полевых кухонь к работе?",
    "Чем свидетельствует история создания полевых кухонь?",
    "Чем отмечается роль полевой кухни в армиях?",
    "Для чего осуществляется техническое обслуживание полевых кухонь?",
    "Что подразумевает эффективное использование полевых кухонь?",
    "Что предполагает полевая кухня?",
    "С какой целью разрабатываются учебные программы по обслуживанию полевых кухонь?",
    "Чем способствуют инновации в области упаковки продуктов?",
    "Что позволяет разработка новых материалов для полевых кухонь?",
    "Что повышает использование систем автоматической дезинфекции на полевых кухнях?",
    "С какой целью осуществляется утилизация отходов на полевых кухнях?",
    "Какую роль играет технический персонал на полевых кухнях?",
    "Какую роль играет обеспечение гигиены на полевых кухнях?",
    "С какой целью проводятся тренировки на полевых кухнях?",
    "Что обеспечивает использование энергосберегающих технологий на полевых кухнях?",
    "Как производится контроль качества продуктов на полевых кухнях?",
    "Какую поддержку обеспечивает сетевое подключение полевых кухонь?",
    "Чем способствует развитие дистанционного управления на полевых кухнях?",
    "Чему способствуют полевые кухни?",
    "С какой целью разрабатываются инструкции по безопасности на полевых кухнях?",
    "Что повышает эффективное распределение обязанностей на полевых кухнях?",
    "Для чего полевые кухни оборудуют системами очистки воды?",
    "Что позволяет использование солнечных батарей на полевых кухнях?",
    "Что проходит технический персонал на полевых кухнях?",
    "Как разработка программного обеспечения влияет на работу на полевых кухнях?",
    "Что предотвращает использование надежных контейнеров для хранения продуктов на полевых кухнях?",
    "Чем способствует создание устойчивых катализаторов для систем отопления на полевых кухнях?",
    "Зачем проводится обучение персонала по правилам пожарной безопасности на полевых кухнях?",
    "Как влияет использование теплоизоляционных материалов на полевых кухнях?",
    "Что гарантирует тщательная проверка продуктов перед приготовлением на полевых кухнях?",
    "Какие потребности удовлетворяет разработка специальных меню на полевых кухнях?",
    "Что снижает использование биоразлагаемой посуды на полевых кухнях?",
    "Что обеспечивает подготовка экстренных запасов продовольствия на полевых кухнях?",
    "Что уменьшает применение систем автоматической дозировки ингредиентов на полевых кухнях?",
    "Что позволяют выявлять регулярные инспекции оборудования на полевых кухнях?",
    "Что оптимизирует использование систем автоматизированного управления запасами на полевых кухнях?",
    "Какой целью проводится обучение персонала методам экономии воды на полевых кухнях?",
    "Что на полевых кухнях проводится с целью подготовки к работе в условиях экстремальных температур?",
    "Что позволяет снизить риск распространения инфекций и аллергических реакций на полевых кухнях?",
    "Что обеспечивает биометрическая идентификация персонала на полевых кухнях?",
    "Чему способствует эффективное управление отходами на полевых кухнях?",
    "Что повышает осведомленность персонала о правилах безопасности и соблюдение стандартов на полевых кухнях?",
    "Что гарантирует использование высокоэффективных систем фильтрации воды на полевых кухнях?",
    "Что повышает моральный дух и психологическое благополучие персонала на полевых кухнях?",
    "Как выглядела первая полевая кухня приготовления?",
    "Как выглядит электроспираль?",
    "Что предотвращают регулярные проверки санитарно-гигиенических условий на полевых кухнях?",
    "Что ускоряет применение технологий искусственного интеллекта на полевых кухнях?",
    "Что учитывают разработанные специализированные диетические рационы на полевых кухнях?",
    "Что позволяет использование адаптивных систем регулирования температуры на полевых кухнях?",
    "Что способствует быстрому реагированию на чрезвычайные ситуации и спасению жизней на полевых кухнях?",
    "Что снижает разработка систем рационального использования энергии на полевых кухнях?",
    "Как выглядит камера сгорания?",
    "Что позволяет разработка систем автоматизированной утилизации отходов на полевых кухнях?",
    "Что повышает использование технологии блокчейн для обеспечения прозрачности и надежности данных на полевых кухнях?",
    "Что снижает разработка методов экологической упаковки на полевых кухнях?",
    "Что оптимизирует использование мобильных приложений для автоматизации учета и планирования на полевых кухнях?",
    "Что обеспечивает разработка систем автоматического контроля качества продуктов на полевых кухнях?",
    "Что обеспечивает использование беспилотных авиационных систем для доставки продуктов на полевые кухни?",
    "Как выглядит котел?",
    "Что гарантирует использование систем обратного осмоса для очистки воды на полевых кухнях?",
    "Чему содействует разработка технологий переработки органических отходов на полевых кухнях?",
    "Что обеспечивает использование систем гидропоники для выращивания свежих овощей на полевых кухнях?",
    "Что повышает разработка программ обучения по кулинарному искусству на полевых кухнях?",
    "Как выглядит полевая кухня?",
    "Что усиливает разработка систем виртуальной реальности для тренировок на полевых кухнях?",
    "Что обеспечивает использование технологий 3D-печати для создания индивидуальных кухонных инструментов на полевых кухнях?",
    "Что повышает разработка методов биоинженерии для увеличения урожайности на полевых кухнях?",
    "Что позволяет разработка систем дистанционного мониторинга и управления для полевых кухонь?"
  ];



function Script() {
    for (let i = 0; i < questions.length; i++) {
        if (confirm("Продолжить диалог?")) {
            let userQuestion = prompt("Введите вопрос", questions[i]);
            alert(getAnswer(userQuestion));
        } else {
            break;
        }
    }
}
            
var dialogOn = false;

function dialog_window() {
  document.body.innerHTML += "<div id='dialog' class='dialog' style='margin-left:-25px;'>" + 
  "<div class='label' onclick='openDialog()'>Нажимай сюда😜</div>" +
  "<div class='header'>История</div>" +
  "<div class='history' id='history'></div>" +
  "<div class='question'><input id='Qdialog' placeholder='Введите вопрос'/> <br><button onclick='ask(\"Qdialog\")'>Спросить</button></div>" + "<button class='button-quest' onclick='clearHistory()'>Очистить всю историю</button>" +
  "</div>";
  //API-ключ для подключения к речевому сервису Yandex
  window.ya.speechkit.settings.apikey='5c6d6536-b453-4589-9bc7-f16c7a795106';
  //добавление элемента управления "Поле для голосового ввода"
  //с выводом распознанной речи в строку ввода текста
  var textline = new ya.speechkit.Textline('Qdialog',{onInputFinished:function(text){
  document.getElementById('Qdialog').value=text;}});
}

dialog_window();

function openDialog(){
  if(dialogOn) {  		//анимация закрытия диалогового окна
      $("#dialog").animate({"margin-left":"-25px"},1000,function(){});
          dialogOn=false;
  }
  
  else {				//анимация открытия диалогового окна
      $("#dialog").animate({"margin-left":"-1180px"},1000,function() {});
          dialogOn=true;
  clearInterval(timer);
  }
}

function ask(questionInput){
  //переменная для считывания содержания окна ввода вопроса:
  var question=document.getElementById(questionInput).value;
  //активизация диалога
  dialogOn=true;
  //создаем переменную и сохраняем в ней тег <div> 
  var newDiv=document.createElement("div");
  //задаем класс оформления созданного блока
  newDiv.className='question';
  //заполняем созданный блок текстом вопроса
  newDiv.innerHTML=question;
  //вставляем созданный блок в блок <history> и закрываем его
  document.getElementById("history").appendChild(newDiv);
  +"</div>";
  //создаем еще один блок <div>
  newDiv=document.createElement("div");
  //задаем класс оформления созданного блока 
  newDiv.className='answer';
  //наполняем созданный блок ответом, полученным от функции getAnswer()
  newDiv.innerHTML=getAnswer(question);
  //добавляем в ответ тег аудио, ссылающийся на звук от синтезатора Yandex
  newDiv.innerHTML+=
  "<audio controls='true' autoplay='true'src='http://tts.voicetech.yandex.net/ key=5c6d6536-b453-4589-9bc7-f16c7a795106 text="
  +newDiv.innerText+"'></audio>";
  //в котором указывается формат звука и язык озвучиваемого текста generate?format=wav&lang=ru-RU&
  //а также ключ доступа к SpeechKit Cloud API 
  //озвучиваемый текст, который берется из сгенерированного ответа
  //вставка зввукового блока в блок <history>
  document.getElementById("history").appendChild(newDiv);
  //запуск звука
  if(newDiv.lastChild.tagName=="AUDIO"){newDiv.lastChild.play();	}
  //прокрутка в окне истории ответов в самый низ
  document.getElementById("history").scrollTop = 
          document.getElementById("history").scrollHeight;	
  //очистка текстового поля для ввода нового вопроса
  document.getElementById(questionInput).value="";
}            
  
function clearHistory() {
    var historyDiv = document.getElementById("history");
    historyDiv.innerHTML = ''; 
}
                